gfxd> AUTOCOMMIT OFF;
gfxd> -- MODULE DML033

-- SQL Test Suite, V6.0, Interactive SQL, dml033.sql
-- 59-byte ID
-- TEd Version #

-- AUTHORIZATION HU
   set schema HU;
0 rows inserted/updated/deleted
gfxd> --O   SELECT USER FROM HU.ECCO;
  VALUES USER;
1                                                                                                                               
--------------------------------------------------------------------------------------------------------------------------------
HU                                                                                                                              
gfxd> -- RERUN if USER value does not match preceding AUTHORIZATION comment

-- date_time print

-- TEST:0135 Upper and loer case letters are distinct!

-- setup
     INSERT INTO WORKS
            VALUES('UPP','low',100);
1 row inserted/updated/deleted
gfxd> -- PASS:0135 If 1 row is inserted?

      SELECT EMPNUM,PNUM
           FROM WORKS
           WHERE EMPNUM='UPP' AND PNUM='low';
EM&|PN&
-------
UPP|low
gfxd> -- PASS:0135 If EMPNUM = 'UPP' and PNUM = 'low'?

      SELECT EMPNUM,PNUM
           FROM WORKS
           WHERE EMPNUM='upp' OR PNUM='LOW';
EM&|PN&
-------
gfxd> -- PASS:0135 If 0 rows are selected - out of data?

-- restore
     ROLLBACK WORK;
gfxd> -- END TEST >>> 0135 <<< END TEST
-- *************************************************////END-OF-MODULE
;
gfxd> 